CSI API ETABS v1
eConstraintAxis Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eConstraintAxis
Public Enumeration eConstraintAxis
Dim instance As eConstraintAxis
public enum class eConstraintAxis
type eConstraintAxis
Members
Member name | Value | Description
X | 1
Y | 2
Z | 3
AutoAxis | 4
See Also
Reference
ETABSv1 Namespace